# PlasticModulusWeakAxis Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionAnalysisParams..::..PlasticModulusWeakAxis Property
StructuralSectionAnalysisParams Class See Also
---
Plastic section modulus in bending about main weak axis.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double PlasticModulusWeakAxis { get; set; }
```

Visual Basic
---
```text
Public Property PlasticModulusWeakAxis As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double PlasticModulusWeakAxis {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace